{
  "auto_mapping": null,
  "base_model_name_or_path": "meta-llama/Meta-Llama-3-8B-Instruct",
  "encoder_dropout": 0.0,
  "encoder_hidden_size": 4096,
  "encoder_num_layers": 2,
  "encoder_reparameterization_type": "MLP",
  "inference_mode": true,
  "num_attention_heads": 32,
  "num_layers": 32,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 20,
  "peft_type": "P_TUNING",
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 4096
}