{
  "auto_mapping": null,
  "base_model_name_or_path": "meta-llama/Meta-Llama-3-8B-Instruct",
  "inference_mode": true,
  "num_attention_heads": 32,
  "num_layers": 32,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 20,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "random",
  "prompt_tuning_init_text": null,
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 4096,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": null
}