{
  "auto_mapping": null,
  "base_model_name_or_path": "google/gemma-7b-it",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 28,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 20,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "random",
  "prompt_tuning_init_text": null,
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 3072,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": null
}